; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (clear ?x)
               (on-table ?x)
               (arm-empty)
               (holding ?x)
               (on ?x ?y))

  (:action pickup
    :parameters (?ob)
    :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
    :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
                 (not (arm-empty))))

  (:action putdown
    :parameters  (?ob)
    :precondition (holding ?ob)
    :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
                 (not (holding ?ob))))

  (:action stack
    :parameters  (?ob ?underob)
    :precondition (and (clear ?underob) (holding ?ob))
    :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
                 (not (clear ?underob)) (not (holding ?ob))))

  (:action unstack
    :parameters  (?ob ?underob)
    :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
    :effect (and (holding ?ob) (clear ?underob)
                 (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-23)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 )
(:init
(arm-empty)
(on-table b1)
(on b2 b17)
(on b3 b8)
(on b4 b12)
(on b5 b14)
(on b6 b16)
(on b7 b19)
(on b8 b11)
(on b9 b10)
(on b10 b6)
(on b11 b23)
(on b12 b7)
(on-table b13)
(on b14 b4)
(on b15 b3)
(on b16 b20)
(on b17 b1)
(on b18 b21)
(on b19 b15)
(on b20 b2)
(on-table b21)
(on-table b22)
(on b23 b9)
(clear b5)
(clear b13)
(clear b18)
(clear b22)
)
(:goal
(and
(on-table b1)
(on b2 b6)
(on b3 b4)
(on b4 b9)
(on b5 b14)
(on-table b6)
(on b7 b8)
(on b8 b18)
(on-table b9)
(on b10 b17)
(on b11 b23)
(on b12 b1)
(on-table b13)
(on b14 b22)
(on b15 b12)
(on b16 b21)
(on-table b17)
(on b18 b19)
(on b19 b2)
(on-table b20)
(on b21 b3)
(on b22 b15)
(on b23 b13))
)
)

; plan
1. (unstack b5 b14)
   deleted: (on b5 b14) (clear b5) (arm-empty)
   added: (holding b5) (clear b14)
   goals met: 3 of 23
2. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 3 of 23
3. (unstack b14 b4)
   deleted: (on b14 b4) (clear b14) (arm-empty)
   added: (holding b14) (clear b4)
   goals met: 3 of 23
4. (stack b14 b22)
   deleted: (clear b22) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b22)
   goals met: 4 of 23
5. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 4 of 23
6. (stack b5 b14)
   deleted: (clear b14) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b14)
   goals met: 5 of 23
7. (unstack b4 b12)
   deleted: (on b4 b12) (clear b4) (arm-empty)
   added: (holding b4) (clear b12)
   goals met: 5 of 23
8. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 5 of 23
9. (unstack b12 b7)
   deleted: (on b12 b7) (clear b12) (arm-empty)
   added: (holding b12) (clear b7)
   goals met: 5 of 23
10. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 5 of 23
11. (unstack b7 b19)
   deleted: (on b7 b19) (clear b7) (arm-empty)
   added: (holding b7) (clear b19)
   goals met: 5 of 23
12. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 5 of 23
13. (unstack b18 b21)
   deleted: (on b18 b21) (clear b18) (arm-empty)
   added: (holding b18) (clear b21)
   goals met: 5 of 23
14. (stack b18 b19)
   deleted: (clear b19) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b19)
   goals met: 6 of 23
15. (unstack b5 b14)
   deleted: (on b5 b14) (clear b5) (arm-empty)
   added: (holding b5) (clear b14)
   goals met: 5 of 23
16. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 23
17. (unstack b18 b19)
   deleted: (on b18 b19) (clear b18) (arm-empty)
   added: (holding b18) (clear b19)
   goals met: 4 of 23
18. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 4 of 23
19. (unstack b19 b15)
   deleted: (on b19 b15) (clear b19) (arm-empty)
   added: (holding b19) (clear b15)
   goals met: 4 of 23
20. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 4 of 23
21. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 4 of 23
22. (stack b5 b14)
   deleted: (clear b14) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b14)
   goals met: 5 of 23
23. (pickup b18)
   deleted: (clear b18) (on-table b18) (arm-empty)
   added: (holding b18)
   goals met: 5 of 23
24. (stack b18 b19)
   deleted: (clear b19) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b19)
   goals met: 6 of 23
25. (unstack b15 b3)
   deleted: (on b15 b3) (clear b15) (arm-empty)
   added: (holding b15) (clear b3)
   goals met: 6 of 23
26. (stack b15 b12)
   deleted: (clear b12) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b12)
   goals met: 7 of 23
27. (unstack b3 b8)
   deleted: (on b3 b8) (clear b3) (arm-empty)
   added: (holding b3) (clear b8)
   goals met: 7 of 23
28. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 8 of 23
29. (unstack b8 b11)
   deleted: (on b8 b11) (clear b8) (arm-empty)
   added: (holding b8) (clear b11)
   goals met: 8 of 23
30. (stack b8 b18)
   deleted: (clear b18) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b18)
   goals met: 9 of 23
31. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 9 of 23
32. (stack b7 b8)
   deleted: (clear b8) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b8)
   goals met: 10 of 23
33. (pickup b21)
   deleted: (clear b21) (on-table b21) (arm-empty)
   added: (holding b21)
   goals met: 10 of 23
34. (stack b21 b3)
   deleted: (clear b3) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b3)
   goals met: 11 of 23
35. (unstack b11 b23)
   deleted: (on b11 b23) (clear b11) (arm-empty)
   added: (holding b11) (clear b23)
   goals met: 10 of 23
36. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 10 of 23
37. (unstack b23 b9)
   deleted: (on b23 b9) (clear b23) (arm-empty)
   added: (holding b23) (clear b9)
   goals met: 10 of 23
38. (stack b23 b13)
   deleted: (clear b13) (holding b23)
   added: (arm-empty) (clear b23) (on b23 b13)
   goals met: 11 of 23
39. (unstack b9 b10)
   deleted: (on b9 b10) (clear b9) (arm-empty)
   added: (holding b9) (clear b10)
   goals met: 11 of 23
40. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 12 of 23
41. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 12 of 23
42. (stack b11 b23)
   deleted: (clear b23) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b23)
   goals met: 13 of 23
43. (unstack b10 b6)
   deleted: (on b10 b6) (clear b10) (arm-empty)
   added: (holding b10) (clear b6)
   goals met: 13 of 23
44. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 13 of 23
45. (unstack b6 b16)
   deleted: (on b6 b16) (clear b6) (arm-empty)
   added: (holding b6) (clear b16)
   goals met: 13 of 23
46. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 14 of 23
47. (unstack b16 b20)
   deleted: (on b16 b20) (clear b16) (arm-empty)
   added: (holding b16) (clear b20)
   goals met: 14 of 23
48. (stack b16 b21)
   deleted: (clear b21) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b21)
   goals met: 15 of 23
49. (unstack b20 b2)
   deleted: (on b20 b2) (clear b20) (arm-empty)
   added: (holding b20) (clear b2)
   goals met: 15 of 23
50. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 16 of 23
51. (unstack b2 b17)
   deleted: (on b2 b17) (clear b2) (arm-empty)
   added: (holding b2) (clear b17)
   goals met: 16 of 23
52. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 17 of 23
53. (unstack b17 b1)
   deleted: (on b17 b1) (clear b17) (arm-empty)
   added: (holding b17) (clear b1)
   goals met: 17 of 23
54. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 18 of 23
55. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 18 of 23
56. (stack b10 b17)
   deleted: (clear b17) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b17)
   goals met: 19 of 23
57. (unstack b15 b12)
   deleted: (on b15 b12) (clear b15) (arm-empty)
   added: (holding b15) (clear b12)
   goals met: 18 of 23
58. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 18 of 23
59. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 18 of 23
60. (stack b12 b1)
   deleted: (clear b1) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b1)
   goals met: 19 of 23
61. (pickup b15)
   deleted: (clear b15) (on-table b15) (arm-empty)
   added: (holding b15)
   goals met: 19 of 23
62. (stack b15 b12)
   deleted: (clear b12) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b12)
   goals met: 20 of 23
63. (unstack b5 b14)
   deleted: (on b5 b14) (clear b5) (arm-empty)
   added: (holding b5) (clear b14)
   goals met: 19 of 23
64. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 19 of 23
65. (unstack b14 b22)
   deleted: (on b14 b22) (clear b14) (arm-empty)
   added: (holding b14) (clear b22)
   goals met: 18 of 23
66. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 18 of 23
67. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 18 of 23
68. (stack b5 b14)
   deleted: (clear b14) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b14)
   goals met: 19 of 23
69. (pickup b22)
   deleted: (clear b22) (on-table b22) (arm-empty)
   added: (holding b22)
   goals met: 19 of 23
70. (stack b22 b15)
   deleted: (clear b15) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b15)
   goals met: 20 of 23
71. (unstack b7 b8)
   deleted: (on b7 b8) (clear b7) (arm-empty)
   added: (holding b7) (clear b8)
   goals met: 19 of 23
72. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 19 of 23
73. (unstack b16 b21)
   deleted: (on b16 b21) (clear b16) (arm-empty)
   added: (holding b16) (clear b21)
   goals met: 18 of 23
74. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 18 of 23
75. (unstack b5 b14)
   deleted: (on b5 b14) (clear b5) (arm-empty)
   added: (holding b5) (clear b14)
   goals met: 17 of 23
76. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 17 of 23
77. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 17 of 23
78. (stack b14 b22)
   deleted: (clear b22) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b22)
   goals met: 18 of 23
79. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 18 of 23
80. (stack b5 b14)
   deleted: (clear b14) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b14)
   goals met: 19 of 23
81. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 19 of 23
82. (stack b7 b8)
   deleted: (clear b8) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b8)
   goals met: 20 of 23
83. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 20 of 23
84. (stack b16 b21)
   deleted: (clear b21) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b21)
   goals met: 21 of 23
85. (unstack b7 b8)
   deleted: (on b7 b8) (clear b7) (arm-empty)
   added: (holding b7) (clear b8)
   goals met: 20 of 23
86. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 20 of 23
87. (unstack b8 b18)
   deleted: (on b8 b18) (clear b8) (arm-empty)
   added: (holding b8) (clear b18)
   goals met: 19 of 23
88. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 19 of 23
89. (unstack b18 b19)
   deleted: (on b18 b19) (clear b18) (arm-empty)
   added: (holding b18) (clear b19)
   goals met: 18 of 23
90. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 18 of 23
91. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 18 of 23
92. (stack b19 b2)
   deleted: (clear b2) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b2)
   goals met: 19 of 23
93. (pickup b18)
   deleted: (clear b18) (on-table b18) (arm-empty)
   added: (holding b18)
   goals met: 19 of 23
94. (stack b18 b19)
   deleted: (clear b19) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b19)
   goals met: 20 of 23
95. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 20 of 23
96. (stack b8 b18)
   deleted: (clear b18) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b18)
   goals met: 21 of 23
97. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 21 of 23
98. (stack b7 b8)
   deleted: (clear b8) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b8)
   goals met: 22 of 23
99. (unstack b16 b21)
   deleted: (on b16 b21) (clear b16) (arm-empty)
   added: (holding b16) (clear b21)
   goals met: 21 of 23
100. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 21 of 23
101. (unstack b21 b3)
   deleted: (on b21 b3) (clear b21) (arm-empty)
   added: (holding b21) (clear b3)
   goals met: 20 of 23
102. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 20 of 23
103. (unstack b3 b4)
   deleted: (on b3 b4) (clear b3) (arm-empty)
   added: (holding b3) (clear b4)
   goals met: 19 of 23
104. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 19 of 23
105. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 19 of 23
106. (stack b4 b9)
   deleted: (clear b9) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b9)
   goals met: 20 of 23
107. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 20 of 23
108. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 21 of 23
109. (pickup b21)
   deleted: (clear b21) (on-table b21) (arm-empty)
   added: (holding b21)
   goals met: 21 of 23
110. (stack b21 b3)
   deleted: (clear b3) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b3)
   goals met: 22 of 23
111. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 22 of 23
112. (stack b16 b21)
   deleted: (clear b21) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b21)
   goals met: 23 of 23
